# Customer API - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production-customer-api/runs/run-9zW6SKeEMB1SEQER

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda.data.archive_file.default: Refreshing...
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=9f8185544c5882212e48a2b70c764b996761e096]
data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=production-customer-database-cluster-id]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=production-customer-database-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer-api"
    }

  # module.aws_api_gateway.aws_apigatewayv2_api.default will be created
  + resource "aws_apigatewayv2_api" "default" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "api-gateway-production-customer-api-customer-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all                     = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }

      + cors_configuration {
          + allow_credentials = false
          + allow_methods     = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 0
        }
    }

  # module.aws_api_gateway.aws_apigatewayv2_integration.default will be created
  + resource "aws_apigatewayv2_integration" "default" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.aws_api_gateway.aws_apigatewayv2_route.any will be created
  + resource "aws_apigatewayv2_route" "any" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.aws_api_gateway.aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all      = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.aws_api_gateway.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gateway/api-gateway-production-customer-api-customer-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
    }

  # module.aws_api_gateway.aws_lambda_permission.default will be created
  + resource "aws_lambda_permission" "default" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda-production-customer-api-customer-api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.aws_lambda.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/lambda-production-customer-api-customer-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
    }

  # module.aws_lambda.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-customer-api-production-customer-api"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.aws_lambda.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-execution-customer-api-production-customer-api"
    }

  # module.aws_lambda.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../../../../shared/infrastructure/modules/lambda/lambda.zip"
      + function_name                  = "lambda-production-customer-api-customer-api"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "omLknDJ8LH5EYkimRcZ3IPcaFhIot0+5COltdIETBSE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "customer"
          + "environment"   = "production-customer-api"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.database_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "customer-api"
      + password   = (sensitive value)
    }

  # module.database_user.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "random_seed" = "ac759382-3392-47da-9a0a-1316ae980d6c"
        }
      + length           = 64
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + customer_api_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*